ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/fuses.h
/* -------- FUSES_OTP4_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP4 Page Word 1 -------- */
#define FUSES_OTP4_WORD_1_ADC_LINEARITY_1_Pos _UINT32_(0) /* (FUSES_OTP4_WORD_1) ADC Linearity bits 7:5 Position */
#define FUSES_OTP4_WORD_1_ADC_LINEARITY_1_Msk                                                                          \
        (_UINT32_(0x7) << FUSES_OTP4_WORD_1_ADC_LINEARITY_1_Pos) /* (FUSES_OTP4_WORD_1) ADC Linearity bits 7:5 Mask */
#define FUSES_OTP4_WORD_1_ADC_LINEARITY_1(value)                                                                       \
        (FUSES_OTP4_WORD_1_ADC_LINEARITY_1_Msk &                                                                       \
         (_UINT32_(value) << FUSES_OTP4_WORD_1_ADC_LINEARITY_1_Pos)) /* Assigment of value for ADC_LINEARITY_1 in the  \
                                                                        FUSES_OTP4_WORD_1 register */
#define FUSES_OTP4_WORD_1_ADC_BIASCAL_Pos _UINT32_(3) /* (FUSES_OTP4_WORD_1) ADC Bias Calibration Position */
#define FUSES_OTP4_WORD_1_ADC_BIASCAL_Msk                                                                              \
        (_UINT32_(0x7) << FUSES_OTP4_WORD_1_ADC_BIASCAL_Pos) /* (FUSES_OTP4_WORD_1) ADC Bias Calibration Mask */
#define FUSES_OTP4_WORD_1_ADC_BIASCAL(value)                                                                           \
        (FUSES_OTP4_WORD_1_ADC_BIASCAL_Msk &                                                                           \
         (_UINT32_(value) << FUSES_OTP4_WORD_1_ADC_BIASCAL_Pos)) /* Assigment of value for ADC_BIASCAL in the          \
                                                                    FUSES_OTP4_WORD_1 register */
#define FUSES_OTP4_WORD_1_OSC32K_CAL_Pos _UINT32_(6) /* (FUSES_OTP4_WORD_1) OSC32K Calibration Position */
#define FUSES_OTP4_WORD_1_OSC32K_CAL_Msk                                                                               \
        (_UINT32_(0x7F) << FUSES_OTP4_WORD_1_OSC32K_CAL_Pos) /* (FUSES_OTP4_WORD_1) OSC32K Calibration Mask */
#define FUSES_OTP4_WORD_1_OSC32K_CAL(value)                                                                            \
        (FUSES_OTP4_WORD_1_OSC32K_CAL_Msk &                                                                            \
         (_UINT32_(value) << FUSES_OTP4_WORD_1_OSC32K_CAL_Pos)) /* Assigment of value for OSC32K_CAL in the            \
                                                                   FUSES_OTP4_WORD_1 register */
#define FUSES_OTP4_WORD_1_USB_TRANSN_Pos _UINT32_(13) /* (FUSES_OTP4_WORD_1) USB pad Transn calibration Position */
#define FUSES_OTP4_WORD_1_USB_TRANSN_Msk                                                                               \
        (_UINT32_(0x1F) << FUSES_OTP4_WORD_1_USB_TRANSN_Pos) /* (FUSES_OTP4_WORD_1) USB pad Transn calibration Mask */
#define FUSES_OTP4_WORD_1_USB_TRANSN(value)                                                                            \
        (FUSES_OTP4_WORD_1_USB_TRANSN_Msk &                                                                            \
         (_UINT32_(value) << FUSES_OTP4_WORD_1_USB_TRANSN_Pos)) /* Assigment of value for USB_TRANSN in the            \
                                                                   FUSES_OTP4_WORD_1 register */
#define FUSES_OTP4_WORD_1_USB_TRANSP_Pos _UINT32_(18) /* (FUSES_OTP4_WORD_1) USB pad Transp calibration Position */
#define FUSES_OTP4_WORD_1_USB_TRANSP_Msk                                                                               \
        (_UINT32_(0x1F) << FUSES_OTP4_WORD_1_USB_TRANSP_Pos) /* (FUSES_OTP4_WORD_1) USB pad Transp calibration Mask */
#define FUSES_OTP4_WORD_1_USB_TRANSP(value)                                                                            \
        (FUSES_OTP4_WORD_1_USB_TRANSP_Msk &                                                                            \
         (_UINT32_(value) << FUSES_OTP4_WORD_1_USB_TRANSP_Pos)) /* Assigment of value for USB_TRANSP in the            \
                                                                   FUSES_OTP4_WORD_1 register */
#define FUSES_OTP4_WORD_1_USB_TRIM_Pos _UINT32_(23) /* (FUSES_OTP4_WORD_1) USB pad Trim calibration Position */
#define FUSES_OTP4_WORD_1_USB_TRIM_Msk                                                                                 \
        (_UINT32_(0x7) << FUSES_OTP4_WORD_1_USB_TRIM_Pos) /* (FUSES_OTP4_WORD_1) USB pad Trim calibration Mask */
#define FUSES_OTP4_WORD_1_USB_TRIM(value)                                                                              \
        (FUSES_OTP4_WORD_1_USB_TRIM_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << FUSES_OTP4_WORD_1_USB_TRIM_Pos)) /* Assigment of value for USB_TRIM in the FUSES_OTP4_WORD_1 register */
#define FUSES_OTP4_WORD_1_DFLL48M_COARSE_CAL_Pos                                                                       \
        _UINT32_(26) /* (FUSES_OTP4_WORD_1) DFLL48M Coarse Calibration Position */
#define FUSES_OTP4_WORD_1_DFLL48M_COARSE_CAL_Msk                                                                       \
        (_UINT32_(0x3F)                                                                                                \
         << FUSES_OTP4_WORD_1_DFLL48M_COARSE_CAL_Pos) /* (FUSES_OTP4_WORD_1) DFLL48M Coarse Calibration Mask */
#define FUSES_OTP4_WORD_1_DFLL48M_COARSE_CAL(value)                                                                    \
        (FUSES_OTP4_WORD_1_DFLL48M_COARSE_CAL_Msk &                                                                    \
         (_UINT32_(value) << FUSES_OTP4_WORD_1_DFLL48M_COARSE_CAL_Pos)) /* Assigment of value for DFLL48M_COARSE_CAL   \
                                                                           in the FUSES_OTP4_WORD_1 register */
#define FUSES_OTP4_WORD_1_Msk _UINT32_(0xFFFFFFFF) /* (FUSES_OTP4_WORD_1) Register Mask  */


/* -------- FUSES_OTP4_WORD_2 : (FUSES Offset: 0x08) ( R/ 32) OTP4 Page Word 2 -------- */
#define FUSES_OTP4_WORD_2_DFLL48M_FINE_CAL_Pos _UINT32_(0) /* (FUSES_OTP4_WORD_2) DFLL48M Fine Calibration Position */
#define FUSES_OTP4_WORD_2_DFLL48M_FINE_CAL_Msk                                                                         \
        (_UINT32_(0x3FF)                                                                                               \
         << FUSES_OTP4_WORD_2_DFLL48M_FINE_CAL_Pos) /* (FUSES_OTP4_WORD_2) DFLL48M Fine Calibration Mask */
#define FUSES_OTP4_WORD_2_DFLL48M_FINE_CAL(value)                                                                      \
        (FUSES_OTP4_WORD_2_DFLL48M_FINE_CAL_Msk &                                                                      \
         (_UINT32_(value) << FUSES_OTP4_WORD_2_DFLL48M_FINE_CAL_Pos)) /* Assigment of value for DFLL48M_FINE_CAL in    \
                                                                         the FUSES_OTP4_WORD_2 register */
#define FUSES_OTP4_WORD_2_Msk _UINT32_(0x000003FF) /* (FUSES_OTP4_WORD_2) Register Mask  */


