ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/fuses.h
        (_UINT32_(0x1) << FUSES_USER_WORD_0_WDT_WINDOW_0_Pos) /* (FUSES_USER_WORD_0) WDT Window bit 0 Mask */
#define FUSES_USER_WORD_0_WDT_WINDOW_0(value)                                                                          \
        (FUSES_USER_WORD_0_WDT_WINDOW_0_Msk &                                                                          \
         (_UINT32_(value) << FUSES_USER_WORD_0_WDT_WINDOW_0_Pos)) /* Assigment of value for WDT_WINDOW_0 in the        \
                                                                     FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_Msk _UINT32_(0xFE01FF77) /* (FUSES_USER_WORD_0) Register Mask  */

#define FUSES_USER_WORD_0_WDT_WINDOW__Pos _UINT32_(31) /* (FUSES_USER_WORD_0 Position) WDT Window bit x */
#define FUSES_USER_WORD_0_WDT_WINDOW__Msk                                                                              \
        (_UINT32_(0x1) << FUSES_USER_WORD_0_WDT_WINDOW__Pos) /* (FUSES_USER_WORD_0 Mask) WDT_WINDOW_ */
#define FUSES_USER_WORD_0_WDT_WINDOW_(value)                                                                           \
        (FUSES_USER_WORD_0_WDT_WINDOW__Msk & (_UINT32_(value) << FUSES_USER_WORD_0_WDT_WINDOW__Pos))

/* -------- FUSES_USER_WORD_1 : (FUSES Offset: 0x04) (R/W 32) USER Page Word 1 -------- */
#define FUSES_USER_WORD_1_WDT_WINDOW_1_Pos _UINT32_(0) /* (FUSES_USER_WORD_1) WDT Window bits 3:1 Position */
#define FUSES_USER_WORD_1_WDT_WINDOW_1_Msk                                                                             \
        (_UINT32_(0x7) << FUSES_USER_WORD_1_WDT_WINDOW_1_Pos) /* (FUSES_USER_WORD_1) WDT Window bits 3:1 Mask */
#define FUSES_USER_WORD_1_WDT_WINDOW_1(value)                                                                          \
        (FUSES_USER_WORD_1_WDT_WINDOW_1_Msk &                                                                          \
         (_UINT32_(value) << FUSES_USER_WORD_1_WDT_WINDOW_1_Pos)) /* Assigment of value for WDT_WINDOW_1 in the        \
                                                                     FUSES_USER_WORD_1 register */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_Pos _UINT32_(3) /* (FUSES_USER_WORD_1) WDT Early Warning Offset Position */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_Msk                                                                             \
        (_UINT32_(0xF) << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) WDT Early Warning Offset Mask */
#define FUSES_USER_WORD_1_WDT_EWOFFSET(value)                                                                          \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_Msk &                                                                          \
         (_UINT32_(value) << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos)) /* Assigment of value for WDT_EWOFFSET in the        \
                                                                     FUSES_USER_WORD_1 register */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC8_Val _UINT32_(0x0) /* (FUSES_USER_WORD_1) 8 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC16_Val _UINT32_(0x1) /* (FUSES_USER_WORD_1) 16 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC32_Val _UINT32_(0x2) /* (FUSES_USER_WORD_1) 32 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC64_Val _UINT32_(0x3) /* (FUSES_USER_WORD_1) 64 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC128_Val _UINT32_(0x4) /* (FUSES_USER_WORD_1) 128 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC256_Val _UINT32_(0x5) /* (FUSES_USER_WORD_1) 256 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC512_Val _UINT32_(0x6) /* (FUSES_USER_WORD_1) 512 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC1024_Val _UINT32_(0x7) /* (FUSES_USER_WORD_1) 1024 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC2048_Val _UINT32_(0x8) /* (FUSES_USER_WORD_1) 2048 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC4096_Val _UINT32_(0x9) /* (FUSES_USER_WORD_1) 4096 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC8192_Val _UINT32_(0xA) /* (FUSES_USER_WORD_1) 8192 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC16384_Val _UINT32_(0xB) /* (FUSES_USER_WORD_1) 16384 clock cycles  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC8                                                                            \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC8_Val                                                                       \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 8 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC16                                                                           \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC16_Val                                                                      \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 16 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC32                                                                           \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC32_Val                                                                      \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 32 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC64                                                                           \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC64_Val                                                                      \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 64 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC128                                                                          \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC128_Val                                                                     \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 128 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC256                                                                          \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC256_Val                                                                     \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 256 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC512                                                                          \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC512_Val                                                                     \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 512 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC1024                                                                         \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC1024_Val                                                                    \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 1024 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC2048                                                                         \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC2048_Val                                                                    \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 2048 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC4096                                                                         \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC4096_Val                                                                    \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 4096 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC8192                                                                         \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC8192_Val                                                                    \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 8192 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_EWOFFSET_CYC16384                                                                        \
        (FUSES_USER_WORD_1_WDT_EWOFFSET_CYC16384_Val                                                                   \
         << FUSES_USER_WORD_1_WDT_EWOFFSET_Pos) /* (FUSES_USER_WORD_1) 16384 clock cycles Position  */
#define FUSES_USER_WORD_1_WDT_WEN_Pos _UINT32_(7) /* (FUSES_USER_WORD_1) WDT Window Mode Enable Position */
#define FUSES_USER_WORD_1_WDT_WEN_Msk                                                                                  \
        (_UINT32_(0x1) << FUSES_USER_WORD_1_WDT_WEN_Pos) /* (FUSES_USER_WORD_1) WDT Window Mode Enable Mask */
#define FUSES_USER_WORD_1_WDT_WEN(value)                                                                               \
        (FUSES_USER_WORD_1_WDT_WEN_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << FUSES_USER_WORD_1_WDT_WEN_Pos)) /* Assigment of value for WDT_WEN in the FUSES_USER_WORD_1 register */
#define FUSES_USER_WORD_1_WDT_WEN_DISABLED_Val _UINT32_(0x0) /* (FUSES_USER_WORD_1) WDT is disabled  */
#define FUSES_USER_WORD_1_WDT_WEN_ENABLED_Val _UINT32_(0x1) /* (FUSES_USER_WORD_1) WDT is enabled  */
#define FUSES_USER_WORD_1_WDT_WEN_DISABLED                                                                             \
        (FUSES_USER_WORD_1_WDT_WEN_DISABLED_Val                                                                        \
         << FUSES_USER_WORD_1_WDT_WEN_Pos) /* (FUSES_USER_WORD_1) WDT is disabled Position  */
#define FUSES_USER_WORD_1_WDT_WEN_ENABLED                                                                              \
        (FUSES_USER_WORD_1_WDT_WEN_ENABLED_Val                                                                         \
         << FUSES_USER_WORD_1_WDT_WEN_Pos) /* (FUSES_USER_WORD_1) WDT is enabled Position  */
#define FUSES_USER_WORD_1_BOD33_HYST_Pos _UINT32_(8) /* (FUSES_USER_WORD_1) BOD33 Hysteresis Position */
#define FUSES_USER_WORD_1_BOD33_HYST_Msk                                                                               \
        (_UINT32_(0x1) << FUSES_USER_WORD_1_BOD33_HYST_Pos) /* (FUSES_USER_WORD_1) BOD33 Hysteresis Mask */
#define FUSES_USER_WORD_1_BOD33_HYST(value)                                                                            \
        (FUSES_USER_WORD_1_BOD33_HYST_Msk &                                                                            \
         (_UINT32_(value) << FUSES_USER_WORD_1_BOD33_HYST_Pos)) /* Assigment of value for BOD33_HYST in the            \
                                                                   FUSES_USER_WORD_1 register */
#define FUSES_USER_WORD_1_BOD33_HYST_DISABLED_Val _UINT32_(0x0) /* (FUSES_USER_WORD_1) No Hysteresis  */
#define FUSES_USER_WORD_1_BOD33_HYST_ENABLED_Val _UINT32_(0x1) /* (FUSES_USER_WORD_1) Hysteresis Enabled  */
#define FUSES_USER_WORD_1_BOD33_HYST_DISABLED                                                                          \
        (FUSES_USER_WORD_1_BOD33_HYST_DISABLED_Val                                                                     \
         << FUSES_USER_WORD_1_BOD33_HYST_Pos) /* (FUSES_USER_WORD_1) No Hysteresis Position  */
#define FUSES_USER_WORD_1_BOD33_HYST_ENABLED                                                                           \
        (FUSES_USER_WORD_1_BOD33_HYST_ENABLED_Val                                                                      \
         << FUSES_USER_WORD_1_BOD33_HYST_Pos) /* (FUSES_USER_WORD_1) Hysteresis Enabled Position  */
#define FUSES_USER_WORD_1_NVMCTRL_REGION_LOCKS_Pos _UINT32_(16) /* (FUSES_USER_WORD_1) NVM Region Locks Position */
#define FUSES_USER_WORD_1_NVMCTRL_REGION_LOCKS_Msk                                                                     \
        (_UINT32_(0xFFFF) << FUSES_USER_WORD_1_NVMCTRL_REGION_LOCKS_Pos) /* (FUSES_USER_WORD_1) NVM Region Locks Mask  \
                                                                          */
#define FUSES_USER_WORD_1_NVMCTRL_REGION_LOCKS(value)                                                                  \
        (FUSES_USER_WORD_1_NVMCTRL_REGION_LOCKS_Msk &                                                                  \
         (_UINT32_(value)                                                                                              \
          << FUSES_USER_WORD_1_NVMCTRL_REGION_LOCKS_Pos)) /* Assigment of value for NVMCTRL_REGION_LOCKS in the        \
                                                             FUSES_USER_WORD_1 register */
#define FUSES_USER_WORD_1_Msk _UINT32_(0xFFFF01FF) /* (FUSES_USER_WORD_1) Register Mask  */


